### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [93]:
import pandas as pd

data1 = [4, 8, 15, 16, 23, 42]

data1_series = pd.Series(data1) # creating panda series

print(data1_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [94]:
ls = range(10) # list of 10 elements

In [95]:
pd.Series(ls) # converting list to panda series

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [96]:
dict1 = {'Name':['Alice', 'Bob', 'Gender'], 'Age' : [25,30,27], 'Gender' : ['Female', 'Male', 'Female']}

In [97]:
df1 = pd.DataFrame(dict1) # creating data frame

In [98]:
df1.loc[:, ['Name']]

     Name
0   Alice
1     Bob
2  Gender

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
    
    DataFrame is a 2-dimensional labeled data structure. We can think of it like a spreadsheet or SQL table, or a dict of Series objects. DataFrame elements can have heterogenous data in them. DataFrames size is mutable, means elements can be dropped, added to DataFrame.
    
    Panda.series is a 1-dimensional labeled data structure. Series elements must have homogenous data only. Series size is immutable, means size of the series object is immutable.

In [99]:
import pandas as pd

fruits = ['Apple', 'Banana', 'Kiwi', 'Orange']

dry_fruits = ['Cashew', 'Almonds', 'Walnuts', 'Dates']

fruits_series = pd.Series(fruits) # creating a panda series using list

print(fruits_series)

0     Apple
1    Banana
2      Kiwi
3    Orange
dtype: object

In [100]:
dry_fruits_series = pd.Series(dry_fruits) # creating a panda series using list

print(dry_fruits_series)

0     Cashew
1    Almonds
2    Walnuts
3      Dates
dtype: object

In [101]:
dict2 = {"Fruits" : fruits, "Dry_Fruits" : dry_fruits} # create a dict

data_frame = pd.DataFrame(dict2) # creating a panda data frame using dict

print(data_frame)

   Fruits Dry_Fruits
0   Apple     Cashew
1  Banana    Almonds
2    Kiwi    Walnuts
3  Orange      Dates

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
      
    We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.
    
    Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.
    
    Summary of Statistics of DataFrame using describe() method.
    
    Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe
    
    Merging DataFrames using merge(), arguments passed are the dataframes to be merged along with the column name.
    
    Renaming the columns of dataframe using rename(), arguments passed are the columns to be renamed & inplace.
    
    Sorting the DataFrame using sort_values() method.
    
    .loc is label base & .iloc is integer position based methods used for slicing & indexing of data.

In [102]:
import pandas as pd

In [103]:
dict3 = {'country' : ['India', 'Japana', 'Russia', 'China'], "code" : ['IN', 'JP', 'RU', 'CH']}

In [104]:
countries_df = pd.DataFrame(dict3) # creatind data frame

In [105]:
countries_df

  country code
0   India   IN
1  Japana   JP
2  Russia   RU
3   China   CH

In [106]:
# We can read the dataframe by using head() function also which is having an argument (n) i.e. number of rows to be displayed.

countries_df.head(2)

  country code
0   India   IN
1  Japana   JP

In [107]:
# Counting the rows and columns in DataFrame using shape(). It returns the no. of rows and columns enclosed in a tuple.

countries_df.shape

(4, 2)

In [108]:
# Summary of Statistics of DataFrame using describe() method.

countries_df.describe()

       country code
count        4    4
unique       4    4
top      India   IN
freq         1    1

In [109]:
# Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.

countries_df.dropna()

  country code
0   India   IN
1  Japana   JP
2  Russia   RU
3   China   CH

In [110]:
# Merging DataFrames using merge(), arguments passed are the dataframes to be merged along with the column name.

countries_df1 = countries_df

merged_df = pd.merge(countries_df, countries_df1, on='country')

merged_df

  country code_x code_y
0   India     IN     IN
1  Japana     JP     JP
2  Russia     RU     RU
3   China     CH     CH

In [111]:
# Sorting the DataFrame using sort_values() method.

countries_df.sort_values(by = ['country'], ascending=True)

  country code
3   China   CH
0   India   IN
1  Japana   JP
2  Russia   RU

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
    
    DataFrame is immutable., elements can be added, deleted or modified

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [112]:
import pandas as pd

colors = ['blue', 'yellow', 'green', 'red']

colors_series = pd.Series(colors) # create a panda series

In [113]:
colors_code = ['#0000FF', '#FFFF00', '#00FF00', '#FF0000']

colors_code_series = pd.Series(color_code) # create a panda series

In [114]:
colors_single_letter_rep = ['B', 'Y', 'G', 'R']

colors_single_letter_rep_series = pd.Series(color_single_letter_rep) # create a panda series

In [115]:
colors_data_frame = pd.concat([colors_series, colors_code_series, colors_single_letter_rep_series], axis=1) #concat method combines two or more series into a DataFrame

colors_data_frame

        0        1  2
0    blue  #0000FF  B
1  yellow  #FFFF00  Y
2   green  #00FF00  G
3     red  #FF0000  R